Revit 2027 API
ParameterTypeId.ConstructionName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConstructionName { get; }
Public Shared ReadOnly Property ConstructionName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConstructionName {
	ForgeTypeId^ get ();
}
static member ConstructionName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace